In [5]:
import numpy as np
import pandas as pd

In [3]:
s1 = pd.Series([1,2,3,4])
print(s1)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
s1.index = np.arange(1,5)

In [7]:
print(s1)

1    1
2    2
3    3
4    4
dtype: int64

In [14]:
s2 = pd.Series(np.random.randint(1,100,25))
print(s2)

0     76
1     46
2     84
3     81
4     58
5     56
6      9
7     46
8     41
9     80
10    48
11    78
12    12
13    95
14    29
15    59
16    76
17    72
18    45
19    96
20    21
21    35
22    81
23    11
24    71
dtype: int32

In [15]:
s2.aggregate(['max', 'min', 'count', 'mean'])

max      96.00
min       9.00
count    25.00
mean     56.24
dtype: float64

In [16]:
s2.value_counts()

76    2
81    2
46    2
95    1
11    1
35    1
21    1
96    1
45    1
72    1
59    1
29    1
12    1
78    1
48    1
80    1
41    1
9     1
56    1
58    1
84    1
71    1
Name: count, dtype: int64

In [21]:
df1 = pd.DataFrame(np.random.randint(1,100,10), columns=['Random Numbers'], index=np.arange(1,11))

In [22]:
print(df1)

    Random Numbers
1               29
2               52
3               53
4               71
5               87
6               58
7               78
8               96
9               41
10              77

In [23]:
df2 = pd.DataFrame([['Vikram', 21], ['Anil', 30], ['Jaya Lakshmi', 55], ['Trimurthulu', 65]], columns=['Name', 'Age'], index=np.arange(1,5))

In [24]:
print(df2)

           Name  Age
1        Vikram   21
2          Anil   30
3  Jaya Lakshmi   55
4   Trimurthulu   65

In [33]:
df2.loc[0:4,'Age']

1    21
2    30
3    55
4    65
Name: Age, dtype: int64

In [38]:
df2.loc[df2.Age == 30]

   Name  Age
2  Anil   30

In [41]:
df2.loc[df2.Age > 25, 'Name':]

           Name  Age
2          Anil   30
3  Jaya Lakshmi   55
4   Trimurthulu   65

In [46]:
df2.iloc[0:4,1:]

   Age
1   21
2   30
3   55
4   65

In [47]:
df2['Sex'] = ['Male', 'Male', 'Female', 'Male']

In [48]:
df2

           Name  Age     Sex
1        Vikram   21    Male
2          Anil   30    Male
3  Jaya Lakshmi   55  Female
4   Trimurthulu   65    Male

In [49]:
del df2['Sex']

In [50]:
print(df2)

           Name  Age
1        Vikram   21
2          Anil   30
3  Jaya Lakshmi   55
4   Trimurthulu   65

In [93]:
df2.loc[5] = ['Chandana', 22]

In [53]:
print(df2)

           Name Age
1        Vikram  21
2          Anil  30
3  Jaya Lakshmi  55
4   Trimurthulu  65
5      Chandana  22

In [62]:
df2.drop(index=[3,4,5], columns=['Age'])

     Name
1  Vikram
2    Anil

In [78]:
df2

           Name Age
1        Vikram  21
2          Anil  30
3  Jaya Lakshmi  55
4   Trimurthulu  65
5      Chandana  22

In [94]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      object
dtypes: object(2)
memory usage: 292.0+ bytes

In [65]:
df2.describe(percentiles=[.25, .5, .95])

          Name  Age
count        5    5
unique       5    5
top     Vikram   21
freq         1    1

In [95]:
df2.head()

           Name Age
1        Vikram  21
2          Anil  30
3  Jaya Lakshmi  55
4   Trimurthulu  65
5      Chandana  22

In [67]:
df2.tail()

           Name Age
1        Vikram  21
2          Anil  30
3  Jaya Lakshmi  55
4   Trimurthulu  65
5      Chandana  22

In [103]:
df2['Age'].agg(['max', 'min', 'count', 'mean', 'std', 'var',])

max       65.000000
min       21.000000
count      5.000000
mean      38.600000
std       20.156885
var      406.300000
Name: Age, dtype: float64

In [97]:
max(df2.Age)

65

In [104]:
df8 = pd.DataFrame(
    {
        'Name':['Vikram','Ganesh','Shannu','Teja','Harsha','Bharghav'],
        'Sex':['M','M','M','M','F','F'],
        'Age':[21,20,20,21,20,21],
        'City':['Pkl','Pkl','Bmvr','Bmvr','Bmvr','Bmvr'],
        'Job':[4,8,8,3,2,18]
    },index=range(1,7)
)

In [111]:
df8.groupby('City').max()

        Name Sex  Age  Job
City
Bmvr    Teja   M   21   18
Pkl   Vikram   M   21    8

In [112]:
file2 = pd.read_csv('https://raw.githubusercontent.com/AshishJangra27/In-One-Go/main/Pandas/Football.csv')

In [136]:
file2

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
658,Netherlands,Eredivisie,( ),Cyriel Dessers,26,0,2461,15,14.51,0.56,84,43,3.24,1.66,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [117]:
file2.isna().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [129]:
file2['Club'].fillna("( )", inplace=True)

In [130]:
file2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [120]:
file2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     626 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB